ProgessBase/Documents/ПРГ_ЗагрузкаБюджетаЭТК.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<Document>
		<Properties>
			<Name>ПРГ_ЗагрузкаБюджетаЭТК</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccumulationRegister.ПРГ_РезервыЭТК</xr:Item>
				<xr:Item>AccumulationRegister.ПРГ_БюджетЭТК</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ВидОперации</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ПРГ_ВидыОперацийЗагрузкиБюджетаИРезервовЭТК</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Бюджет</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ПериодПлана</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Контрагент</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сумма</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>16</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>Резервы</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ПериодРезерва</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Дивизион</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ПРГДивизионы</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДопОфис</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ПРГДопОфисы</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Дистрибьютор</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Контрагент</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сумма</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>16</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

ProgessBase/AccumulationRegisters/ПРГ_БюджетЭТК.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<AccumulationRegister>
		<Properties>
			<Name>ПРГ_БюджетЭТК</Name>
			<RegisterType>Turnovers</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Сумма</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>16</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ПериодПлана</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Контрагент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

ProgessBase/AccumulationRegisters/ПРГ_РезервыЭТК.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<AccumulationRegister>
		<Properties>
			<Name>ПРГ_РезервыЭТК</Name>
			<RegisterType>Turnovers</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Сумма</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>16</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ПериодРезерва</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Дивизион</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПРГДивизионы</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ДопОфис</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПРГДопОфисы</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Дистрибьютор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Контрагент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

ProgessBase/Enums/ПРГ_ВидыОперацийЗагрузкиБюджетаИРезервовЭТК.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<Enum>
		<Properties>
			<Name>ПРГ_ВидыОперацийЗагрузкиБюджетаИРезервовЭТК</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ЗагрузкаБюджетЭТК</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЗагрузкаРезервовЭТК</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

ProgessBase/Documents/ПРГ_ЗагрузкаБюджетаЭТК/Ext/ObjectModule.bsl
//начало изменений Ожиганов А. б/н добавление загрузки резервов по ЭТК  29.11.2016 
Перем мУдалятьДвижения;
//конец изменений 
Процедура ОбработкаПроведения(Отказ, Режим)

	//начало изменений Ожиганов А. б/н добавление загрузки резервов по ЭТК  29.11.2016 
		Если мУдалятьДвижения Тогда
			Движения.ПРГ_БюджетЭТК.Записывать = Истина;
			Движения.ПРГ_БюджетЭТК.Очистить();
			
			Движения.ПРГ_РезервыЭТК.Записывать = Истина;
			Движения.ПРГ_РезервыЭТК.Очистить();
			
		КонецЕсли;
	//конец изменений 

	//начало изменений Ожиганов А. б/н добавление загрузки резервов по ЭТК  29.11.2016 
	Если ВидОперации = Перечисления.ПРГ_ВидыОперацийЗагрузкиБюджетаИРезервовЭТК.ЗагрузкаБюджетЭТК Тогда
	//конец изменений 
		// регистр ПРГ_БюджетЭТК 
		Движения.ПРГ_БюджетЭТК.Записывать = Истина;
		Движения.ПРГ_БюджетЭТК.Очистить();
		Для Каждого ТекСтрокаБюджет Из Бюджет Цикл
			Движение = Движения.ПРГ_БюджетЭТК.Добавить();
			Движение.Период = Дата;
			Движение.Организация = Организация;
			Движение.ПериодПлана = ТекСтрокаБюджет.ПериодПлана;
			Движение.Контрагент = ТекСтрокаБюджет.Контрагент;
			Движение.Сумма = ТекСтрокаБюджет.Сумма;
		КонецЦикла;
	//начало изменений Ожиганов А. б/н добавление загрузки резервов по ЭТК  29.11.2016 	
	Иначе 
		
		ПРГ_РезервыЭТКНЗ = Движения.ПРГ_РезервыЭТК;
		ПРГ_РезервыЭТКНЗ.Записывать = Истина;
		ПРГ_РезервыЭТКНЗ.Очистить();
		
		Для Каждого ТекСтрока Из Резервы Цикл
			Движение 			    = ПРГ_РезервыЭТКНЗ.Добавить();
			Движение.Период			= Дата;       
			Движение.ПериодРезерва = ТекСтрока.ПериодРезерва;
			Движение.Дивизион      = ТекСтрока.Дивизион;
			Движение.ДопОфис   	   = ТекСтрока.ДопОфис;
			Движение.Дистрибьютор  = ТекСтрока.Дистрибьютор;
			Движение.Контрагент    = ТекСтрока.Контрагент;
			Движение.Сумма		   = ТекСтрока.Сумма;
		КонецЦикла;
	КонецЕсли;	
	//конец изменений 
КонецПроцедуры

//начало изменений Ожиганов 29.11.2016 б/н изменение на печать pdf 
Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	// Вставить содержимое обработчика.
	мУдалятьДвижения = НЕ ЭтоНовый();	
	Если НЕ ЗначениеЗаполнено(ВидОперации) Тогда
	 	ВидОперации = Перечисления.ПРГ_ВидыОперацийЗагрузкиБюджетаИРезервовЭТК.ЗагрузкаБюджетЭТК;
	КонецЕслИ;	
КонецПроцедуры


Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	// Вставить содержимое обработчика.
	Если Не ЗначениеЗаполнено(ВидОперации) или  
		ВидОперации = Перечисления.ПРГ_ВидыОперацийЗагрузкиБюджетаИРезервовЭТК.ЗагрузкаБюджетЭТК Тогда
		ПроверяемыеРеквизиты.Добавить("Бюджет.ПериодПлана");
		ПроверяемыеРеквизиты.Добавить("Бюджет.Контрагент");
	Иначе
		ПроверяемыеРеквизиты.Добавить("Резервы.ПериодРезерва");
		ПроверяемыеРеквизиты.Добавить("Резервы.Дивизион");
		ПроверяемыеРеквизиты.Добавить("Резервы.ДопОфис");
		ПроверяемыеРеквизиты.Добавить("Резервы.Дистрибьютор");
		ПроверяемыеРеквизиты.Добавить("Резервы.Контрагент");
	КонецЕсли;
КонецПроцедуры
//конец изменений
